
Случае с антипатернами.

1. Магические числа
Иногда для сокращения времени по написанию использовал сокращения. Через некоторое время при внесении изменений в данный код приходилось долго вспоминать что бы это значило.
Выводил в константы.

Удобно видеть все константы в одгом месте. При необходимости менять какую либу константу не нужно искать по всему коду. 

2. Cryptic Code // Шифрокод

Использовал не так часто. Но иногда дабы сократить время шел на такой шаг. Но как практика показывает это не место где нужно сокращать. Приходиться вспоминать что обозначает сокращение.

Решение использовать понятные имена константам.

3. Copy–Paste // Программирование методом копирования–вставки 
Когда начала изучать java часто использовал такой способ. 

Стараюсь не пользоваться.


4. Golden hammer // Золотой молоток 
Когда знаешь только 1 инструмент решения задачи, решение является единственным правильном рещение. 
Для парсинга JSON имеется несколько способов. Каждый вывбирает удобный и производительный способ.


5. Premature optimization // Преждевременная оптимизация
Данная ситуация случается редко. Но пару раз сталкивался. 


6. Reinventing the wheel // Изобретение велосипеда
Для реализации определенных задач есть уже готовые framework. Нужно просто изучить новые неизученные технологии. Намного упрощается решение задач